<?php
function errs_out($id)
{
    $ERRS = [
        10  => '错误的地址或版本',
        11  => '方法不存在',
        12  => 'model不存在',
        15  => '文件丢失，请联系管理员',
        16  => '不存在的类，请联系管理员',
        20  => '已有相同用户名',
        21  => '已有相同集团',
        98  => '未知数据类型',
        99  => '为必传参数',
        100 => '传递数据格式错误',
        101 => '数据字符长度错误',
        102 => '数据大小错误',
        105 => 'sign为空',
        106 => 'time为空',
        107 => '超时',
        108 => 'sign验证失败',
        109 => '非法访问',
        1001 => '未实名',
        1002 => '未绑卡',
    ];
    return isset($ERRS[$id]) ? $ERRS[$id] : '未指定错误信息!';
}
